[
  {
    "all_text":
      "Advanced Technology Systems Co., McLean, Virginia, has been awarded a $64,087,234 firm-fixed-price, cost reimbursable, and time-and-materials contract for Egypt border security.This contract provides the Arab Republic of Egypt with a mobile surveillance sensor security system to support the Egyptian Border Guard mission to protect Egypt's national borders.  Work will be performed at STARA Technologies Corp., Gilbert, Arizona, and is expected to be complete by Aug. 20, 2019.  This contract involves foreign military sales to the Arab Republic of Egypt, and is the result of a sole-source acquisition.  Foreign military sales funds in the amount of $63,666,892 will be obligated at the time of award.  Air Force Life Cycle Management Center, Hanscom Air Force Base, Massachusetts, is the contracting activity (FA8730-18-C-0009).",
    "vendor_name": "Advanced Technology Systems Co.",
    "contract_number": "FA873018C0009",
    "mod_number": "",
    "end_date": "2019-8-20",
    "potential_value": 64087234,
    "obligation": 63666892,
    "competition": "NO",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Lockheed Martin Aeronautics Co., Marietta, Georgia, has been awarded a $14,723,933 cost-plus-incentive-fee modification (P00003) for C-5 communications, navigation, surveillance/air traffic management engineering and manufacturing development program and incorporates the automatic dependent surveillance-broadcast out technology.  Work will be performed inMarietta, Georgia, and is expected to be complete by Sept. 25, 2019.  Fiscal 2017 research and development funds in the amount of $5,287,373 are being obligated at the time of award.  Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA8625-17-C-6589).",
    "vendor_name": "Lockheed Martin Aeronautics Co.",
    "contract_number": "FA862517C6589",
    "mod_number": "P00003",
    "end_date": "2019-9-25",
    "potential_value": 14723933,
    "obligation": 5287373,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Professional Solutions1 LLC, Alexandria, Virginia, has been awarded a competitive firm-fixed-price, indefinite-delivery/indefinite-quantity contract to provide Distributed Tactical Communication System, Global Logistical Services Management with establishment of field service representatives, and support services in support of the Department of Defense Enhanced Mobile Satellite Service Gateway program.  The cumulative face value of this action is $48,000,000 with the base year funded by fiscal 2018 defense working capital funds.  Performance will be at various locations within the U.S. and deployed locations worldwide.  The basic proposal was solicited via electronic means through FedBizOps with six proposals received.  The period of performance is 12 months from Nov.1, 2017, to Oct. 31, 2018, with four option periods.  The Defense Information Technology Contracting Organization, Scott Air Force Base, Illinois, is the contracting activity (HC1013-18-D-0001).",
    "vendor_name": "Professional Solutions1 LLC",
    "contract_number": "HC101318D0001",
    "mod_number": "",
    "end_date": "2018-10-31",
    "potential_value": 48000000,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Safe Ports Inc.,* Charleston, South Carolina, has been awarded a $22,102,251 hybrid fixed-price-incentive-firm, indefinite-delivery/indefinite-quantity contract for warehouse anddistribution operations. This contract has a five-year ordering period with no option periods, inclusive of a three-month transition period. This was a competitive acquisition with six responses received. Locations of performance are South Carolina and Virginia, with an Oct. 31, 2022, performance completion date. Using customer is Defense Logistics Agency. Type of appropriation is fiscal 2018 through 2023 defense working capital funds. In this ordering period, $4,066,096 will be obligated using fiscal 2018 funds. The contracting activity is the Defense Logistics Agency Distribution, New Cumberland, Pennsylvania (SP3300-18-D-5002).",
    "vendor_name": "Safe Ports Inc.",
    "contract_number": "SP330018D5002",
    "mod_number": "",
    "end_date": "2022-10-31",
    "potential_value": 22102251,
    "obligation": 4066096,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Rocky Brands Inc., Nelsonville, Ohio, has been awarded a maximum $19,688,970 modification (P00001) exercising the first one-year option period of one-year base contract (SPE1C1-17-D-1004) with four one-year option periods for hot-weather combat boots. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. Locations of performance are Ohio and Puerto Rico, with an Oct. 20, 2018, performance completion date. Using military service is Army. Type of appropriation is fiscal 2018 through 2019 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "vendor_name": "Rocky Brands Inc.",
    "contract_number": "SPE1C117D1004",
    "mod_number": "P00001",
    "end_date": "2018-10-20",
    "potential_value": 19688970,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "AJ Associates Manufacturing & Engineering Co. Inc.,* Clearwater, Florida, has been awarded a maximum $8,197,879 firm-fixed-price contract for F-18 aircraft link assemblies. This is a 50-month contract with no option periods. This was a competitive acquisition with two offers received. Location of performance is Florida, with a Dec. 22, 2021, performance completion date. Using military service is Navy. Type of appropriation is fiscal 2018 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia (SPERA7-18-C-0012).",
    "vendor_name": "AJ Associates Manufacturing & Engineering Co. Inc.",
    "contract_number": "SPERA718C0012",
    "mod_number": "",
    "end_date": "2021-12-22",
    "potential_value": 8197879,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Raytheon Integrated Defense Systems, Woburn, Massachusetts, is being awarded an indefinite-delivery/indefinite-quantity contract with cost-plus-fixed-fee and cost-plus-incentive-fee line items with a stated maximum value of $1,500,000,000. Under this follow-on contract, the contractor will provide operations and sustainment (O&S) support for the Army Navy Transportable Radar Surveillance Model 2 (AN/TPY-2); and Sea-Based X-Band (SBX) radar.  This O&S support includes AN/TPY-2 radar logistics support, AN/TPY-2 sustaining engineering, AN/TPY-2 transition and transfer, AN/TPY-2 depot transition, SBX logistics support, and SBX sustaining engineering. This award is the result of a sole-source acquisition. Fiscal 2017 research, development, test and evaluation funds in the amount of $1,252,264 are being obligated at time of award. The work will be performed in Woburn, Massachusetts, and several stateside and overseas locations. The ordering period is from Nov. 1, 2017, through Oct. 31, 2020, with four successive one year option periods provided in the contract. The Missile Defense Agency, Huntsville, Alabama is the contracting activity (HQ0147-18-D-0001).",
    "vendor_name": "Raytheon Integrated Defense Systems",
    "contract_number": "HQ014718D0001",
    "mod_number": "",
    "end_date": "2020-10-31",
    "potential_value": 1500000000,
    "obligation": 1252264,
    "competition": "NO",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "AAI Corp., doing business as Textron Systems, Hunt Valley, Maryland, has been awarded a $26,932,086 modification (P00168) to contract W58RGZ-08-C-0023 for procurement of 17 Block III kits and spares for Shadow Tactical unmanned aircraft systems. Work will be performed in Hunt Valley, Maryland, with an estimated completion date of Aug. 27, 2020. Fiscal 2017 aviation procurement (Army) funds in the amount of $26,932,086 were obligated at the time of the award. U.S. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "vendor_name": "AAI Corp.",
    "contract_number": "W58RGZ08C0023",
    "mod_number": "P00168",
    "end_date": "2020-8-27",
    "potential_value": 26932086,
    "obligation": 26932086,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "L-3 Technologies, Greenville, Texas, has been awarded a not-to-exceed $210,000,000 cost-plus-fixed-fee undefinitized contract action for aircraft engineering, procurement and fabrication.  Work will be performed in Greenville, Texas, with an estimated completion date of April 2, 2022.  This contract involves 100 percent foreign military sales and was a sole-source acquisition. Foreign military sales funds in the amount of $102,900,000 were obligated at the time of the award.  The 645th Aeronautical Systems Group, Wright-Patterson Air Force Base, Ohio, is the contracting activity (FA8620-18-F-4801).",
    "vendor_name": "L-3 Technologies",
    "contract_number": "FA862018F4801",
    "mod_number": "",
    "end_date": "2022-4-2",
    "potential_value": 210000000,
    "obligation": 102900000,
    "competition": "NO",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Johnson & Johnson, on behalf of Ethicon US LLC, Piscataway, New Jersey, has been awarded a maximum $39,046,220 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for medical surgical products. This was a competitive acquisition with seven responses received. This is a one-year base with nine one-year option periods. Maximum dollar amount is for the life of the contract. To date, this is the eighth contract awarded from standing solicitation SPM2D0-12-R-0004. Locations of performance are New Jersey and Tennessee, with a Nov. 2, 2027, performance completion date. Using customers are Army, Navy, Air Force, Marine Corps and federal civilian agencies. Type of appropriation is fiscal 2018 through 2028 warstopper funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE2D0-18-D-0001).",
    "vendor_name": "Johnson & Johnson",
    "contract_number": "SPE2D018D0001",
    "mod_number": "",
    "end_date": "2027-11-2",
    "potential_value": 39046220,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Pratt & Whitney, East Hartford, Connecticut, has been awarded a $2,740,747,815 firm-fixed-price contract for F-117 engine sustainment support. Work will be performed at United Airlines, San Francisco, California; Columbus Engine Center, Columbus, Georgia; and Tinker Air Force Base, Oklahoma, and is expected to be completed by Sept. 30, 2022.  This contract involves foreign military sales to the United Kingdom, Canada, United Arab Emirates, Kuwait, Qatar, India, Australia and Strategic Airlift Capability.  This award is the result of a sole-source acquisition.  Foreign military sales funds; and operations and maintenance funds in the amount of $52,707,534 are being obligated at the time of award.  Air Force Life Cycle Management Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8124-18-D-0001).  (Awarded Oct. 1)",
    "vendor_name": "Pratt & Whitney",
    "contract_number": "FA812418D0001",
    "mod_number": "",
    "end_date": "2022-9-30",
    "potential_value": 2740747815,
    "obligation": 52707534,
    "competition": "NO",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "IAP Worldwide Services Inc., Cape Canaveral, Florida, is being awarded a $19,370,663 recurring/non-recurring services type contract for base operations services at Naval Support Activity Annapolis.  The work to be performed provides for all management, supervision, labor hours, training, equipment, and supplies necessary to perform base operating services to include but not limited to facility investment, service calls, pest control, operation of utility plants, refuse collection, special events, and snow and ice removal.  Work will be performed in Annapolis, Maryland, and is expected to be completed July 2018.  No funds will be obligated at the time of award.  Fiscal 2018 operations and maintenance (Navy); and fiscal 2018 Navy working capital funds in the amount of $13,398,781 for recurring work will be obligated on individual task orders issued during the contract period.  The Naval Facilities Engineering Command, Washington, Washington, District of Columbia, is the contracting activity (N40080-18-D-0500).",
    "vendor_name": "IAP Worldwide Services Inc.",
    "contract_number": "N4008018D0500",
    "mod_number": "",
    "end_date": "2018-7-1",
    "potential_value": 19370663,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "M&M Manufacturing, LLC,*** Lajas, Puerto Rico, has been awarded a maximum $7,079,188 modification (P00023) exercising the fourth one-year option period of a one-year base contract (SPM1C1-14-D-1015) with four one-year option periods for various types of coats and trousers. The modification brings the maximum dollar value of the contract to $30,970,285 from $23,891,097. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. Location of performance is Puerto Rico, with a May 28, 2019, estimated performance completion date. Using customers are Air Force and Afghanistan government. Types of appropriation are fiscal 2018 through 2019 defense working capital and foreign military sales funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "vendor_name": "M&M Manufacturing",
    "contract_number": "SPM1C114D1015",
    "mod_number": "P00023",
    "end_date": "2019-5-28",
    "potential_value": 30970285,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Harris Corp., Clifton, New Jersey, is being awarded a $100,000,000 modification for a non-competitive, single award, indefinite-delivery/indefinite-quantity contract. The contract provides suite of integrated radio and frequency countermeasure components and related services for the Technology Applications program office and CV-22 program offices. The majority of the work is performed in Clifton, NJ, with ordering periods ending on July 30, 2019. This modification increases the ceiling amount by $100,000,000 from $190,000,000 to $290,000,000 million. This modification was awarded through non-competitive award in accordance with Federal Acquisition Regulation 6.302-1. U.S. Special Operations Command, Tampa, Florida, is the contracting activity (H92241-14-D-0006).",
    "vendor_name": "Harris Corp.",
    "contract_number": "H9224114D0006",
    "mod_number": "",
    "end_date": "2019-7-30",
    "potential_value": 290000000,
    "obligation": 0,
    "competition": "",
    "order_on_previously_issued": ""
  },
  {
    "all_text":
      "Lockheed Martin Space Systems Co., Sunnyvale, California, is being awarded $71,642,534 for cost-plus-incentive-fee and cost-plus-fixed-fee modification P00003 to a previously awarded contract (N00030-17-C-0100) for Trident II (D5) missile deployed system support.  The work will be performed in Cape Canaveral, Florida (44.49 percent); Sunnyvale, California (22.65 percent); Magna, Utah (11.47 percent); Miamisburg, Ohio (3.35 percent); Inglewood, California (1.84 percent); Denver, Colorado (1.63 percent); Bangor, Washington (1.51 percent); Titusville, Florida (1.45 percent); Tullahoma, Tennessee (1.4 percent); Kings Bay, Georgia (1.11 percent); Modesto, California (1.09 percent); and other various locations (less than 1.00 percent each; 8.01 percent total), with an estimated date of completion of Sept. 30, 2022.  Fiscal 2018 weapons procurement (Navy) funds in the amount of $60,904,122; fiscal 2017 research, development, test, and evaluation (Navy) funds in the amount of $2,933,563; and fiscal 2017 weapons procurement (Navy) funds in the amount of $1,982,075 are being obligated on this award, none of which will expire at the end of the current fiscal year. Subject to availability, fiscal 2018 research, development, test, and evaluation (Navy) funds in the amount of $5,822,774 will be obligated for the effort awarded and incrementally funded. None of which will expire at the end of the current fiscal year.  Strategic Systems Programs, Washington, District of Columbia, is the contracting activity.",
    "vendor_name": "Lockheed Martin Space Systems Co.",
    "contract_number": "N0003017C0100",
    "mod_number": "P00003",
    "end_date": "2022-9-30",
    "potential_value": 71642534,
    "obligation": 1982075,
    "competition": "NO",
    "order_on_previously_issued": "YES"
  }
]
