[
  {
    "all_text" : "Signalink Inc., Madison, Alabama (FA2487-18-D-4000); Corvid Technologies LLC., Mooresville, North Carolina (FA2487-18-D-4100); Maden Technologies - Maden Tech Consulting Inc., Arlington, Virginia (FA2487-18-D-4200); Intuitive Research and Technology Corp., Huntsville, Alabama (FA2487-18-D-4300); Wavelink Inc., Huntsville, Alabama (FA2487-18-D-4400); Cummings Aerospace Inc., Huntsville, Alabama (FA2487-18-D-4500); Radiance Technologies Inc., Alabama (FA2487-18-D-4600); Booz Allen Hamilton Inc., McLean, Virginia (FA2487-18-D-4700); IERUS Technologies Inc., Alabama (FA2487-18-D-4800); Dynetics Inc., Huntsville, Alabama (FA2487-18-D-4900); Trident Research LLC., Austin, Texas (FA2487-18-D-5000); Georgia Technical Research Institute, Georgia Tech Applied Research Corp., Atlanta, Georgia (FA2487-18-D-5100); Raytheon Co., Indianapolis, Indiana (FA2487-18-D-5200); and RT Logic, Colorado Springs, Colorado (FA2487-18-D-5300); have been awarded a shared ceiling, multiple award indefinite-delivery/indefinite-quantity contracts in the amount of $998,000,000. Contractor will provide research, development, test and evaluation of weapon systems, subsystems, and components.  Work will be performed at each contractor’s facilities.  This award is the result of a competitive acquisition and 14 offers were awarded. Fiscal 2017 research, development, test, and evaluation funds in the amount of $14,000 - $1,000 per delivery order, per company are being obligated at time of award.  Air Force Test Center, Eglin Air Force Base, Florida, is the contracting activity."
  },
  {
    "all_text" : "Booz Allen Hamilton, McLean, Virginia (N65236-15-D-4800/P00010); CENTRA Technology Inc., Burlington, Massachusetts (N65236-15-D-4801/P00025); ManTech SRS Technologies Inc., Arlington, Virginia (N65236-15-D-4802/P00012); and Schafer Corp., Chelmsford, Massachusetts (N65236-15-D-4803/P00015), are each being awarded a combined $13,486,179 modification to a previously awarded indefinite-delivery/indefinite-quantity, cost-plus-fixed-fee, with provisions for firm-fixed-price task orders, performance based contract.  This multiple award contract (MAC) is currently in its last option period with a contract expiration date of Nov. 24, 2017.  These modifications increase the basic contract estimated ceiling by $13,486,179 and changes the cumulative estimated value of the contracts from $96,945,000 to $110,431,179, which will be split among the four current awardees.  These modifications will also extend Federal Acquisition Regulation clause 52.216-22 period of performance end date from 180 days to Nov. 24, 2019.  This MAC is for technical, programmatic, financial, and administrative support services for existing and future Defense Advanced Research Projects Agency Tactical Technology Office programs.  Work will be performed in Arlington, Virginia, and is expected to be completed by November 2019.  No funds are being obligated at the time of award.  No funds will expire at the end of the current fiscal year.  This MAC was previously procured competitively by full and open competition via the Space and Naval Warfare Systems Command e-commerce Central website and the Federal Business Opportunities website.  Space and Naval Warfare Systems Center Atlantic, Charleston, South Carolina, is the contracting activity."
  },
  {
    "all_text" : "Booz Allen Hamilton Inc., McLean, Virginia (N00189-17-D-Z051); Altarum Institute, Ann Arbor, Michigan (N00189-17-D-Z052); Deloitte & Touche LLP, Arlington, Virginia (N00189-17-D-Z053); and Kennell and Associates Inc., Falls Church, Virginia (N00189-17-D-Z054), was awarded a combined estimated $20,398,936 indefinite-delivery/indefinite-quantity, cost-plus-fixed-fee multiple award  contracts that will include terms and conditions for the placement of both cost-plus-fixed-fee and firm-fixed-price task orders to provide data analytic services for the systematic examination of operational process efficiencies, populations health management strategies, and the quality of medical care and event outcomes with respect to near- and long-term resource consumption in support of the Navy, Bureau of Medicine and Surgery.  Each contract will run concurrently and each will include a 60-month base ordering period and an optional six-month ordering period.  If all options are exercised, the total estimated value of the contracts combined will be $22,588,606.  Work will be performed at various contractor locations throughout the U.S. (90 percent); and government facilities in Falls Church, Virginia (10 percent).  The ordering period of the contract is expected to be completed by Sept. 2022; if all options are exercised, ordering will be completed by March 2023.  Fiscal 2017 operations and maintenance (defense health procurement) funds in the amount of $40,000 will be obligated ($10,000 on each of the four contracts to fund the contracts’ minimum amounts) and will expire at the end of the current fiscal year.  This contract was competitively procured for the award of multiple contracts pursuant to the authority set forth in Federal Acquisition Regulation 16.504.  The requirement was posted to the Federal Business Opportunities website, with 12 offers received.  Naval Supply Systems Command Fleet Logistics Center Norfolk Contracting Department, Philadelphia, Pennsylvania, is the contracting activity.  Awarded Sept. 15, 2017"
  },
  {
    "all_text" : "Boeing Co., Hazelwood, Missouri, is the final company to be awarded a $499,000,000 multiple award, fair opportunity, indefinite-delivery/indefinite-quantity shared ceiling contract for six companies for the Aerospace Systems Air Platform Technology Research program. These contracts provide research for affordable, revolutionary capabilities for the warfighter. Work will be performed in Hazelwood, Missouri, and is expected to be completed by Aug, 31, 2025. This award is the result of competitive acquisition and six offers were received and six awarded. Fiscal 2017 research and development funds in the amount of $100,000 are being obligated at time of award. Air Force Research Laboratory, Wright-Patterson Air Force Base, Ohio, is the contracting office (FA8650-17-D-2716)."
  },
  {
    "all_text" : "BAE Systems Technology Solutions & Services Inc., Rockville, Maryland (N00421-17-D-0045); Science and Engineering Services LLC,* Huntsville, Alabama (N00421-17-D-0046); Sierra Nevada Corp., Centennial, Colorado (N00421-17-D-0047); Coherent Technical Services Inc.,* Lexington Park, Maryland (N00421-17-D-0048); Dayton T. Brown Inc.,* Bohemia, New York (N00421-17-D-0049); J.F. Taylor Inc.,* Lexington Park, Maryland (N00421-17-D-0050); KIHOMAC,* Fairborn, Ohio (N00421-17-D-0051); Science and Engineering Services LLC,* Huntsville, Alabama (N00421-17-D-0052); and Strata-G Solutions Inc., Huntsville, Alabama (N00421-17-D-0054), are each being awarded indefinite-delivery/indefinite-quantity, multiple-award contracts to provide prototype air vehicle modification, mission systems, aircraft stores and support equipment designs, build-to-print technical data packages, kits and installed systems for test and evaluation of new systems and capabilities as well as fleet introduction.  These services are in support of the Naval Air Warfare Center Aircraft Division’s Aircraft Prototype Systems Division (APSD).  The scope of this contract is to cover all phases of APSD projects from feasibility studies and concept development through prototype development, systems integration laboratory standup and testing concluding with production in limited quantities to meet test and evaluation, fleet evaluation or urgent fielding requirements.  The estimated aggregate ceiling for all contracts is $486,952,035, with the companies having an opportunity to compete for individual orders.  Work will be performed in Patuxent River, Maryland; and at contractor facilities, and is expected to be completed in September 2022.  Funds are not being obligated at time of award, funds will be obligated on individual orders as they are issued.  These contracts were competitively procured via an electronic request for proposals in two lots: Lot I, competitive unrestricted, and Lot II, competitive small business set-aside.  Seven proposals were received for Lot I; 10 proposals were received for Lot II.  The Naval Air Warfare Center Aircraft, Patuxent River, Maryland, is the contracting activity."
  }
]